# 1. Написати функцію яка в циклі зчитує з консолі
# введені користувачем дані і записує їх в список.
# Написати декоратор який видасть час виконання роботи функції
#
# 2. Написати функцію яка приймає два катети і повертає
# значення гіпотензузи. Написати декоратор на функцію,
# який виводить на екран текст з довжиною катетів і гіпотенузи.
# Важливо! Функція повинно повернути саме значення гіпотенузи як число,
# а декоратор повинен зробити вивід на екран
# наприклад такого тексту “При катетах 3, 4 – гіпотенуза дорівнює 5”.

def view_hypo(hypo_):
    def wrap(x, y):
        print(f'In legs {x} , {y} the hypotenuse is equal to : {hypo_(x, y)}')
    return wrap


@view_hypo
def hypo(x, y):
    hypotenuse = (x ** 2 + y ** 2) ** 0.5
    return hypotenuse


hy = view_hypo(hypo(1, 4))


# 3. Написати функцію яка приймає список елементів і знаходить суму,
# до функції написати декоратор який перед тим як
# запустити функцію видаляє з списку всі не чисельні типи даних,
# але якщо є строка яку можна перевести в число,
# (наприклад “1”) то строка приводиться до чисельного типу даних
#
# 4. Написати функцію яка приймає на вхід ціле число n створює і
# повертає список цілих чисел від 0 до n.
# Написати до цієї функції декоратор який всі елементи отриманого
# списку переведе в строковий тип даних
